{
  "quotes": [
    "General, complete health dentistry involves the diagnosis and treatment of general conditions affecting the health and appearance of your teeth, gums, and jaw. ",
    "If you have any dental concerns or we catch anything during your checkup, we’re happy to show you a dentist’s view of your mouth while we walk you through your diagnosis and treatment. ",
    "X-rays are a normal part of dental exams for patients of all ages. ",
    "All it takes is less than an hour a couple of times a year to help preserve your oral health and your smile for decades to come. ",
    "You owe it to your future self! ",
    "Gum disease ranges from gingivitis to more serious forms and stages of periodontitis. ",
    "Other warning signs include gums that bleed more than you’d expect after flossing, receding gums, pain or sensitivity in your teeth, loose-feeling teeth, and persistent bad breath that can’t be explained. ",
    "In the past, gum disease used to require surgery, but that’s not the case anymore! ",
    "One American dies of oral cancer approximately every hour of every day. ",
    "Fluoride is a natural mineral that works to promote the remineralization of enamel, meaning it makes the outside of teeth stronger and more resistant to decay. ",
    "Dental sealants are applied to the chewing surfaces of back teeth to fill in hard-to-clean crevices where pesky food particles can get caught and cause decay. ",
    "This small dental investment can yield years of protection for your child’s (or your) teeth, making it well worth it. ",
    "There’s more than one reason to wear a mouthguard. ",
    "The end result is a practically undetectable restoration that feels and looks just like a natural tooth. ",
    "A fixed dental bridge is permanently secured in place to bridge gaps left by one or more missing teeth. ",
    "Crowns are used to restore single teeth, to attach bridges, to cover dental implants, and even as a preventive measure when a tooth is in imminent danger of cracking. ",
    "Dental crowns are sometimes called caps. ",
    "A deep cavity, crack, or other injury to a tooth can damage the nerve, allowing bacteria to enter and kill the living tissue. ",
    "Inside each tooth, there is soft tissue with nerves and blood vessels running from the root to the crown. ",
    "We then seal it off and place a crown to prevent other bacteria from entering and strengthen the tooth. ",
    "Instead of feeling embarrassed about having a noticeable, silver filling, no one will even realize you have one! ",
    "For patients dealing with cracked, chipped, or worn down teeth, veneers may be the perfect solution. ",
    "Despite it’s bad (and false) reputation, root canal therapy is actually a common, stress-free procedure. ",
    "We’re grateful to our patients for trusting us with their smiles, and we do everything we can to ensure they have a pleasant, stress-free experience. ",
    "From routine checkups to full-mouth restorations to cosmetic smile makeovers, our knowledgeable, skilled team looks forward to helping you achieve your best smile. ",
    "Services that will leave you smiling ",
    "Routine preventive care creates a strong foundation for your oral health, and keeps your smile in tip-top shape. ",
    "Our goal is to not only restore your smile, but also restore your self-confidence. ",
    "Do you have damaged, infected, or missing teeth? ",
    "Daydreaming about a picture-perfect smile? ",
    "From routine cleanings to complex mouth restorations to cosmetic smile makeovers, we can help you achieve your dream smile!",
    "If you’re missing even one tooth, you may feel as though you’re missing out on things you used to enjoy – talking with ease, smiling with confidence, and even eating your favorite foods.",
    "A dental implant is made up of three different parts: the implant itself, which is a small titanium post inserted into the jawbone; an abutment, which connects the implant to a restoration; and the restoration, either a dental crown, bridge, or denture.",
    "We will also take some X-rays to determine if your jawbone is strong enough for dental implants.",
    "Prevention is the cornerstone of a healthy mouth.",
    "Especially in children, protecting the chewing surfaces of teeth using dental sealants can help prevent decay."
  ]
}